<!doctype html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport"
          content="width=device-width, user-scalable=no, initial-scale=1.0, maximum-scale=1.0, minimum-scale=1.0">
    <meta http-equiv="X-UA-Compatible" content="ie=edge">
    <link rel="stylesheet" href="style.css">
    <title>Document</title>
</head>
<body>
<div class="container">
    <div class="question">
        <a href="task1.php">
            1. Создайте скрипт, который через HTML-форму принимал бы координаты двух точек в декартовой
            системе координат, а после нажатия на кнопку типа submit выводил бы расстояние между двумя точками.
        </a>
    </div>
    <hr>
    <br>
    <div class="question">
        <a href="task2.php">
            2. Создайте HTML-форму, состоящую из двух текстовых полей, в первом из которых вводится
            количество товарных позиций, а во втором — их цена. Обработчик формы должен проверить, является ли введенная
            в
            первом поле информация целым числом, а во втором — удовлетворяющим денежному формату. Если все верно,
            необходимо
            вывести произведение этих двух чисел.
        </a>
    </div>
    <hr>
    <br>
    <div class="question">
        <a href="task3.php">
            3. *По желанию. Создайте форму, содержащую текстовую область textarea и кнопку submit. При
            нажатии на кнопку содержимое тестовой области должно сохраняться в файл content.txt. При повторой загрузке
            формы
            в другом окне содержимое файла content.txt должно подставляться в тестовую форму.
        </a>
    </div>
    <hr>
    <br>
    <div class="question">
        <a href="task4.php">
            4. *По желанию. Создайте форму регистрации, которая бы сохраняла имя и фамилию пользователя в
            таблицу users. Все поля формы обязательны для заполнения и должны быть корректны. Имя и фамилия должны
            содержать
            не менее 2 и не более 20 символов. В случае некорректного заполнения элементов управления формы или, если
            такой
            пользователь уже зарегистрирован, необходимо выводить предупреждающие сообщения.
        </a>
    </div>
    <hr>
    <br>
</div>
</body>
</html>